{"weightsManifest": [{"weights": [{"shape": [128], "dtype": "float32", "name": "batch_normalization_10/gamma"}, {"shape": [128], "dtype": "float32", "name": "batch_normalization_10/beta"}, {"shape": [128], "dtype": "float32", "name": "batch_normalization_10/moving_mean"}, {"shape": [128], "dtype": "float32", "name": "batch_normalization_10/moving_variance"}], "paths": ["group1-shard1of1"]}, {"weights": [{"shape": [128], "dtype": "float32", "name": "batch_normalization_11/gamma"}, {"shape": [128], "dtype": "float32", "name": "batch_normalization_11/beta"}, {"shape": [128], "dtype": "float32", "name": "batch_normalization_11/moving_mean"}, {"shape": [128], "dtype": "float32", "name": "batch_normalization_11/moving_variance"}], "paths": ["group2-shard1of1"]}, {"weights": [{"shape": [32], "dtype": "float32", "name": "batch_normalization_6/gamma"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_6/beta"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_6/moving_mean"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_6/moving_variance"}], "paths": ["group3-shard1of1"]}, {"weights": [{"shape": [64], "dtype": "float32", "name": "batch_normalization_7/gamma"}, {"shape": [64], "dtype": "float32", "name": "batch_normalization_7/beta"}, {"shape": [64], "dtype": "float32", "name": "batch_normalization_7/moving_mean"}, {"shape": [64], "dtype": "float32", "name": "batch_normalization_7/moving_variance"}], "paths": ["group4-shard1of1"]}, {"weights": [{"shape": [64], "dtype": "float32", "name": "batch_normalization_8/gamma"}, {"shape": [64], "dtype": "float32", "name": "batch_normalization_8/beta"}, {"shape": [64], "dtype": "float32", "name": "batch_normalization_8/moving_mean"}, {"shape": [64], "dtype": "float32", "name": "batch_normalization_8/moving_variance"}], "paths": ["group5-shard1of1"]}, {"weights": [{"shape": [128], "dtype": "float32", "name": "batch_normalization_9/gamma"}, {"shape": [128], "dtype": "float32", "name": "batch_normalization_9/beta"}, {"shape": [128], "dtype": "float32", "name": "batch_normalization_9/moving_mean"}, {"shape": [128], "dtype": "float32", "name": "batch_normalization_9/moving_variance"}], "paths": ["group6-shard1of1"]}, {"weights": [{"shape": [3, 3, 128, 128], "dtype": "float32", "name": "conv2d_10/kernel"}, {"shape": [128], "dtype": "float32", "name": "conv2d_10/bias"}], "paths": ["group7-shard1of1"]}, {"weights": [{"shape": [3, 3, 3, 32], "dtype": "float32", "name": "conv2d_6/kernel"}, {"shape": [32], "dtype": "float32", "name": "conv2d_6/bias"}], "paths": ["group8-shard1of1"]}, {"weights": [{"shape": [3, 3, 32, 64], "dtype": "float32", "name": "conv2d_7/kernel"}, {"shape": [64], "dtype": "float32", "name": "conv2d_7/bias"}], "paths": ["group9-shard1of1"]}, {"weights": [{"shape": [3, 3, 64, 64], "dtype": "float32", "name": "conv2d_8/kernel"}, {"shape": [64], "dtype": "float32", "name": "conv2d_8/bias"}], "paths": ["group10-shard1of1"]}, {"weights": [{"shape": [3, 3, 64, 128], "dtype": "float32", "name": "conv2d_9/kernel"}, {"shape": [128], "dtype": "float32", "name": "conv2d_9/bias"}], "paths": ["group11-shard1of1"]}, {"weights": [{"shape": [128, 128], "dtype": "float32", "name": "dense_1/kernel"}, {"shape": [128], "dtype": "float32", "name": "dense_1/bias"}], "paths": ["group12-shard1of1"]}, {"weights": [{"shape": [128, 1], "dtype": "float32", "name": "dense_2/kernel"}, {"shape": [1], "dtype": "float32", "name": "dense_2/bias"}], "paths": ["group13-shard1of1"]}], "modelTopology": {"training_config": {"sample_weight_mode": null, "optimizer_config": {"config": {"beta_2": 0.9990000128746033, "lr": 0.0010000000474974513, "epsilon": 1e-08, "decay": 0.0, "beta_1": 0.8999999761581421}, "class_name": "Adam"}, "loss": "binary_crossentropy", "loss_weights": null, "metrics": ["accuracy"]}, "keras_version": "2.0.6", "model_config": {"config": {"input_layers": [["input_2", 0, 0]], "layers": [{"config": {"batch_input_shape": [null, 198, 198, 3], "dtype": "float32", "sparse": false, "name": "input_2"}, "class_name": "InputLayer", "inbound_nodes": [], "name": "input_2"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 32, "use_bias": true, "trainable": true, "strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "linear", "padding": "valid", "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_size": [3, 3], "name": "conv2d_6"}, "class_name": "Conv2D", "inbound_nodes": [[["input_2", 0, 0, {}]]], "name": "conv2d_6"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_6"}, "class_name": "Activation", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "name": "activation_6"}, {"config": {"epsilon": 0.001, "momentum": 0.99, "gamma_constraint": null, "trainable": true, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_regularizer": null, "beta_constraint": null, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_6"}, "class_name": "BatchNormalization", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "name": "batch_normalization_6"}, {"config": {"trainable": true, "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_5"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "name": "max_pooling2d_5"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64, "use_bias": true, "trainable": true, "strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "linear", "padding": "valid", "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_size": [3, 3], "name": "conv2d_7"}, "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]], "name": "conv2d_7"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_7"}, "class_name": "Activation", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "name": "activation_7"}, {"config": {"epsilon": 0.001, "momentum": 0.99, "gamma_constraint": null, "trainable": true, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_regularizer": null, "beta_constraint": null, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_7"}, "class_name": "BatchNormalization", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "name": "batch_normalization_7"}, {"config": {"trainable": true, "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_6"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "name": "max_pooling2d_6"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64, "use_bias": true, "trainable": true, "strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "linear", "padding": "valid", "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_size": [3, 3], "name": "conv2d_8"}, "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_6", 0, 0, {}]]], "name": "conv2d_8"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_8"}, "class_name": "Activation", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "name": "activation_8"}, {"config": {"epsilon": 0.001, "momentum": 0.99, "gamma_constraint": null, "trainable": true, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_regularizer": null, "beta_constraint": null, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_8"}, "class_name": "BatchNormalization", "inbound_nodes": [[["activation_8", 0, 0, {}]]], "name": "batch_normalization_8"}, {"config": {"trainable": true, "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_7"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "name": "max_pooling2d_7"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 128, "use_bias": true, "trainable": true, "strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "linear", "padding": "valid", "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_size": [3, 3], "name": "conv2d_9"}, "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_7", 0, 0, {}]]], "name": "conv2d_9"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_9"}, "class_name": "Activation", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "name": "activation_9"}, {"config": {"epsilon": 0.001, "momentum": 0.99, "gamma_constraint": null, "trainable": true, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_regularizer": null, "beta_constraint": null, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_9"}, "class_name": "BatchNormalization", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "name": "batch_normalization_9"}, {"config": {"trainable": true, "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_8"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "name": "max_pooling2d_8"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 128, "use_bias": true, "trainable": true, "strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "linear", "padding": "valid", "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_size": [3, 3], "name": "conv2d_10"}, "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_8", 0, 0, {}]]], "name": "conv2d_10"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_10"}, "class_name": "Activation", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "name": "activation_10"}, {"config": {"epsilon": 0.001, "momentum": 0.99, "gamma_constraint": null, "trainable": true, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_regularizer": null, "beta_constraint": null, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_10"}, "class_name": "BatchNormalization", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "name": "batch_normalization_10"}, {"config": {"trainable": true, "data_format": "channels_last", "name": "global_average_pooling2d_2"}, "class_name": "GlobalAveragePooling2D", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "name": "global_average_pooling2d_2"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "units": 128, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_constraint": null, "name": "dense_1"}, "class_name": "Dense", "inbound_nodes": [[["global_average_pooling2d_2", 0, 0, {}]]], "name": "dense_1"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_11"}, "class_name": "Activation", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "activation_11"}, {"config": {"epsilon": 0.001, "momentum": 0.99, "gamma_constraint": null, "trainable": true, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_regularizer": null, "beta_constraint": null, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_11"}, "class_name": "BatchNormalization", "inbound_nodes": [[["activation_11", 0, 0, {}]]], "name": "batch_normalization_11"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "units": 1, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_constraint": null, "name": "dense_2"}, "class_name": "Dense", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "name": "dense_2"}, {"config": {"trainable": true, "activation": "sigmoid", "name": "activation_12"}, "class_name": "Activation", "inbound_nodes": [[["dense_2", 0, 0, {}]]], "name": "activation_12"}], "output_layers": [["activation_12", 0, 0]], "name": "model_1"}, "class_name": "Model"}, "backend": "tensorflow"}}